import re
for i in range(5):
    fileName = 'addtest' + str(i+1) +'.txt'
    file = open(fileName, encoding="utf-8")
    text = file.read()
    print(text + '\n')
    pattern = re.compile(r"\b\w*[аАоОуУэЭыЫюЮяЯеЕиИ]{2}\w*\b(?=[.,\[\]\'\";:\s]*[аАоОуУэЭыЫюЮяЯеЕиИъь]*[БбВвГгДдЖжЗзКкЛлМмНнПпРрСсТтФфХхЦцЧчШшЩщ][аАоОуУэЭыЫюЮяЯеЕиИъь]*\b|[.,\[\]\'\";:\s]*[аАоОуУэЭыЫюЮяЯеЕиИъь]*[БбВвГгДдЖжЗзКкЛлМмНнПпРрСсТтФфХхЦцЧчШшЩщ][аАоОуУэЭыЫюЮяЯеЕиИъь]*[БбВвГгДдЖжЗзКкЛлМмНнПпРрСсТтФфХхЦцЧчШшЩщ][аАоОуУэЭыЫюЮяЯеЕъь]*\b|[.,\[\]\'\";:\s]*[аАоОуУэЭыЫюЮяЯеЕъь]*[БбВвГгДдЖжЗзКкЛлМмНнПпРрСсТтФфХхЦцЧчШшЩщ][аАоОуУэЭыЫюЮяЯеЕиИъь]*[БбВвГгДдЖжЗзКкЛлМмНнПпРрСсТтФфХхЦцЧчШшЩщ][аАоОуУэЭыЫюЮяЯеЕиИъь]*[БбВвГгДдЖжЗзКкЛлМмНнПпРрСсТтФфХхЦцЧчШшЩщ][аАоОуУэЭыЫюЮяЯеЕиИъь]*\b)")
    matches = pattern.findall(text)
    for word in matches:
      print(word)
    print()
    file.close()
